Revit 2026 API

# TaskDialogAddCommandLink(TaskDialogCommandLinkId, String, String) Method

---

Adds a CommandLink associated to the given id, displaying the indicating main and supporting content.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddCommandLink(
	TaskDialogCommandLinkId id,
	string mainContent,
	string supportingContent
)
```
```vb
Public Sub AddCommandLink (
	id As TaskDialogCommandLinkId,
	mainContent As String,
	supportingContent As String
)
```
```cpp
public:
void AddCommandLink(
	TaskDialogCommandLinkId id,
	String^ mainContent,
	String^ supportingContent
)
```
```fsharp
member AddCommandLink :
        id : TaskDialogCommandLinkId *
        mainContent : string *
        supportingContent : string -> unit
```

#### Parameters

id TaskDialogCommandLinkId
     The id of the CommandLink. This corresponds to the value returned by Show() when the link is chosen by the user.
mainContent String
     The main content of the CommandLink.
supportingContent String
     The main content of the CommandLink.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when mainContent is . |
| ArgumentException | Thrown when mainContent is an empty string. |
| ArgumentException | Thrown when the mainContent contains newline characters. |

Parameter mainContent cannot contain newlines.

If the id has already been set to the task dialog, the new CommandLink definition overrides the old one.

CommandLinks will always be shown in the dialog in the order of their ids.

#### Reference

TaskDialog Class

AddCommandLink Overload

Autodesk.Revit.UI Namespace